import configparser

conf = configparser.ConfigParser()
conf["Help"] = {
    "head": "Команди для використання",
    "list": "список днів народження",
    "add_birthday": "додати день народження до списку",
    "delete_birthday": "видалити день народження зі списку",
    "add_note": "додати замітку про когось",
    "help": "довідка",
    "stop": "зупинити",
}

conf["Reminder"] = {
    "week": "Через тиждень",
    "tomorrow": "Завтра",
    "today": "Сьогодні",
    "message_start": "Здоровенькі були! {when} день народження у {name}",
    "message_age": "Йому/Їй виповнюється {age}!",
    "message_note": "(твоя примітка: {note})",
    "message_end": "Сподіваюсь твій подарунок вже готовий? :)",
}

conf["AddBirthday"] = {
    "print_name": "Введіть ім'я:",
    "too_long": "Це ім'я задовге. Оберіть інше:",
    "already_taken": "Це ім'я вже використовується. Оберіть інше:",
    "print_date": "Чудово! Оберіть дату у форматі 22.02.2002 або 22.02:",
    "29th": "Це проблематична дата\nЯ попрошу тебе обрати іншу дату, наприклад 01.03 або 28.02, і потім додати нотатку, вказавши що насправді день народження 29-го використавши команду /add_note\nВибачте за незручності",
    "invalid_date": "Це неправильна дата. Оберіть іншу:",
    "added": "Додано успішно!",
}

conf["AddNote"] = {
    "print_name": "Про кого хочете додати нотатку? (введіть ім'я)",
    "invalid_name": "Цього імені немає у списку. Спробуйте ще раз:",
    "print_desc": "Введіть текст нотатки:{newline}(це може бути ідея для подарунку або нагадування на майбутнє)",
    "added": "Додано успішно!}",
}

conf["DeleteBirthday"] = {
    "print_name": "Кого хочете видалити? (введіть ім'я)",
    "invalid_name": "Цього імені немає у списку. Спробуйте ще раз:",
    "deleted": "Видалено успішно!",
}

conf["List"] = {
    "head": "Твій список:",
    "today_birthday": "сьогодні день народження у {name}!",
    "today": "сьогодні",
    "empty": "Список поки що порожній{newline}Додай дні народження через команду /add_birthday",
}

conf["Misc"] = {
    "start": "Привіт",
    "error": "Щось пішло не так. Рапорт було надіслано адміністратору",
}

conf["Language"] = {
    "language": "ukr",
    "choose": "Виберіть мову",
    "changed": "Бот вивчив українську",
}

conf["Month"] = {
    "1": "Січня",
    "2": "Лютого",
    "3": "Березня",
    "4": "Квітня",
    "5": "Травня",
    "6": "Червня",
    "7": "Липня",
    "8": "Серпня",
    "9": "Вересня",
    "10": "Жовтня",
    "11": "Листопада",
    "12": "Грудня",
}

with open("conf_ukr.ini", "w") as configfile:
    conf.write(configfile)
